## Plan Result (prod_global - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 9 to change, 1 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;private-law&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;adoption&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;cui-ra&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-staff-pet&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;et-syr&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;private-law&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sscs-ibca&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
        name                    = "hmcts-prod"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["private-law"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/privatelawprodPremium"
        name                              = "privatelawprodPremium"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (9 unchanged attributes hidden)

      - custom_rule {
          - action                         = "Block" -> null
          - enabled                        = true -> null
          - name                           = "BlockScriptInJSON" -> null
          - priority                       = 1 -> null
          - rate_limit_duration_in_minutes = 1 -> null
          - rate_limit_threshold           = 10 -> null
          - type                           = "MatchRule" -> null

          - match_condition {
              - match_values       = [
                  - "application/json",
                ] -> null
              - match_variable     = "RequestHeader" -> null
              - negation_condition = false -> null
              - operator           = "Equal" -> null
              - selector           = "content-type" -> null
              - transforms         = [] -> null
            }
        }
      - custom_rule {
          - action                         = "Block" -> null
          - enabled                        = true -> null
          - name                           = "BlockScriptInJSON2" -> null
          - priority                       = 2 -> null
          - rate_limit_duration_in_minutes = 1 -> null
          - rate_limit_threshold           = 10 -> null
          - type                           = "MatchRule" -> null

          - match_condition {
              - match_values       = [
                  - "<script>",
                ] -> null
              - match_variable     = "RequestBody" -> null
              - negation_condition = false -> null
              - operator           = "Contains" -> null
              - transforms         = [] -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ managed_rule {
            # (3 unchanged attributes hidden)

          - override {
              - rule_group_name = "LFI" -> null

              - rule {
                  - action  = "Block" -> null
                  - enabled = false -> null
                  - rule_id = "930130" -> null
                }
            }
          - override {
              - rule_group_name = "RCE" -> null

              - rule {
                  - action  = "Block" -> null
                  - enabled = false -> null
                  - rule_id = "932115" -> null
                }
            }
          - override {
              - rule_group_name = "RFI" -> null

              - rule {
                  - action  = "Block" -> null
                  - enabled = false -> null
                  - rule_id = "931130" -> null
                }
            }
          - override {
              - rule_group_name = "SQLI" -> null

              - rule {
                  - action  = "Block" -> null
                  - enabled = false -> null
                  - rule_id = "942340" -> null
                }
              - rule {
                  - action  = "Block" -> null
                  - enabled = false -> null
                  - rule_id = "942440" -> null
                }
            }

            # (15 unchanged blocks hidden)
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["adoption"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.apply-for-adoption"
        name                = "_dnsauth.apply-for-adoption"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "_9ozmnw86sdvw3w8hbmgpg3htq6rdavz"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["cui-ra"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/manage-your-support-for-hmcts-services.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "_7ki0sfm9bifra1m9k4thyhjqoh3cr8q"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-staff-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "z51qchxt096p5249j1mxrl120fzf9r0q"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["et-syr"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/respond-employment-tribunals.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "_14224mgrkc7hcu22ch6szfm8ta3z1aa"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["private-law"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements-c100.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "_wc9ldqruwnsoi71r1b4o9ld8oititwa"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sscs-ibca"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/appeal-infected-blood-compensation-decision.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "_jzglsigqlsjgrczix10lc72e3knmqqf"
        }
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = (known after apply)
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      ~ id                                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod/providers/Microsoft.Authorization/roleAssignments/67889977-d0e9-6d95-7ef2-9a5d166029ac" -> (known after apply)
      ~ name                                   = "67889977-d0e9-6d95-7ef2-9a5d166029ac" -> (known after apply)
      ~ principal_id                           = "be6f7241-504b-4e2a-8ee8-eb8594088e58" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 9 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2417,"Program":"tfcmt","SHA1":"","Target":"prod_global - TerraformPlanApply","Vars":{}} -->